# -*- encoding: UTF-8 -*-
# ---------------------------------import------------------------------------


class DataBaseName(object):
    """数据库名 Database name of 172"""
    entry = 'jiuming_entry'
    jingjiu_ta = 'jingjiu_ta'
    journal = 'jiuming_journal'
    transfer_agent = 'transfer_agent'
    transfer_agent_fee = 'jiuming_ta_fee'
    transfer_agent_new = 'jiuming_ta_new'
    valuation = 'jiuming_valuation'
    management = 'jm_fundmanagement'


class SocketConstants:
    CLIENT_EXIT_MSG = 'ClientSocketExit'


PRODUCT_CODE_NAME_MAP = {
        # 久铭
        'SCB746': '久盈2号', 'SCH044': '专享1号', 'SCJ125': '久铭50指数', 'SCJ126': '久铭300指数',
        'SCJ127': '久铭500指数', 'SGF044': '创新稳健1号', 'SGH916': '创新稳禄1号', 'SGJ046': '创新稳健2号',
        'SGU439': '信利2号', 'SGV459': '创新稳健6号', 'SGW875': '创新稳健3号', 'SGY058': '创新稳健5号',
        'SGZ225': '信利1号', 'SGZ226': '久铭信利', 'SJ9814': '稳健1号', 'SJQ420': '专享5号',
        'SK5988': '稳健2号', 'SK9610': '久铭2号',
        'SL0762': '久铭3号', 'SL0765': '双盈1号', 'SL0767': '稳健3号',
        'SL0768': '稳健5号', 'SL0769': '稳健6号',
        'SL0771': '稳健7号', 'SL0774': '稳健8号', 'SL0776': '稳健9号',
        'SL0780': '稳健10号', 'SL0785': '稳健11号',
        'SL0786': '稳健12号', 'SL0787': '稳健15号', 'SL0788': '稳健16号',
        'SL0789': '稳健17号', 'SL0790': '稳健18号',
        'SL0791': '稳健19号', 'SL0794': '稳健21号', 'SL0795': '稳健22号',
        'SL0868': '稳利2号', 'SN0910': '久铭1号',
        'SR5846': '收益1号', 'SR7565': '全球1号', 'SS0566': '上证50指数',
        'SS0568': '沪深300指数', 'SS2239': '稳健31号',
        'SS2250': '稳健32号', 'SS2251': '稳健33号', 'SS6382': '久铭5号',
        'SS8710': '中证500指数', 'ST2960': '收益2号',
        'SJT913': '专享6号', 'SJU581': '专享7号', 'SJU632': '专享8号', 'SJU634': '专享9号', 'SJU635': '专享10号','STM641':'专享29号',
        'SLJ180': '专享15号', 'SLN699': '专享16号', 'SLN700': '专享17号', 'SJU643': '专享11号',
        'ST6278': '久铭7号', 'SW8251': '久铭6号', 'SW9199': '稳健23号',
        'SX4199': '久铭8号', 'SX9408': '久铭9号', 'SY0689': '久铭10号',
        'SJR542': '价值1号', 'SJR635': '全球丰收1号', 'SJR493': '成长1号',
        'SGZ955': '专享2号', 'SLZ593': '创新稳禄2号', 'SLZ594': '创新稳禄3号',
        # 静康
        'SCG596': '静康1号', 'SCR397': '静康稳健1号', 'SCR398': '静康全球1号', 'SEX636': '静康稳健3号',
        'SGF434': '静康创新稳健1号', 'SGF656': '静康创新稳禄1号',
        'SJT403': '静久康铭稳健5号', 'SES018': '静康稳健2号',
    }
