# -*- encoding: UTF-8 -*-


OFFSET_OPEN = '开'
OFFSET_CLOSE = '平'
OFFSET_NONE = '无'


# 资产总额缺失，需要用市值总值与资金计算的例外账户
ACCOUNT_CAPITAL_SUM_CALCULATION = (
    '国君普通账户',
    '海通期权账户',
    '国君期权账户',
)

# 市值总额缺失，需要用资产总额和资金计算的例外账户
ACCOUNT_MARKET_SUM_CALCULATION = (
    '财通普通账户', '华泰普通账户', '兴业普通账户', '长江普通账户'
)

# 币种合法性范围与匹配
CURRENCY_RANGE_MAP = {
    'RMB': 'RMB', '人民币': 'RMB',
    'USD': 'USD', '美元': 'USD',
    'HKD': 'HKD', '港币': 'HKD',
}

# 普通账户允许证券代码为空的交易类型
NORMAL_BLANK_SECURITY_TRADE_CLASS_ALLOWANCE = (
    '港股通组合费收取', '银行转证券', '配售配号', '证券转行转取存管交行', '证券转银行', '银行转取存管交行', '银行转取', '现金替代返还',
    '银行转取存管工行', '银行转取交行存管', '银行转存', '银行转存存管交行', '港股通证券组合费', '银行转存存管工行','利息归本','撤销指定',
    '港股通组合费', '批量利息归本存管交行', '批量利息归本存管工行', '银证转入', '组合费', '股息红利税补', '银证转出',
    '新股申购失败', '申购配号', '配售中签', '市值申购中签', '市值认购资金扣收', '市值申购中签扣款', '股息红利扣税农业银行',
    '港股资金可用处理', '银行转存招行存管', '利息结转', '资金调加', '批量利息归本', '资金红冲', '资金蓝补', '|',
    '转托管费', '删除银行账号', '银行帐户开户', '融资合约利息结息扣收', '利息归本', '融资合约利息结息扣收',
    '担保物转入', '港股通组合费收取', '利息结算', '银行转存招行三方存管', '资产修正存', '资产修正取',
    '港股资金可用处理', '深圳市场股息红利个人所得税扣款', '银证转出', '卖出资金预交收', '卖券偿还融资负债', '卖券偿还融资费用',
    '卖券偿还融资利息', '直接偿还融资负债', '直接偿还融资费用', '直接偿还融资利息', '融资买入借款', '股息红利所得税扣款',
    '银行转存交行三方存管', '指定交易登记指定', '银行转取交行三方存管', '融资买入借款', '银行转取招行三方存管', '转存管转出','转存管转入',
    '融资定期还息', '融资白天直接还款', '股息个税征收', '交收资金冻结', '融资定期还息(-)',  '交易资金红冲',
    '融资买入借款(+)', '证券买入清算(融资买入)', '港股卖出资金预交收', '前台收费', '交易资金蓝补','配股缴款',
    'CDR存托服务费N九号'
    # '股息红利税补缴'
)

# 普通账户买入交易类型 （持仓增加，资金减少）
NORMAL_DIRECTION_BUY_TRADE_CLASS = (
    '新股入帐', '红股入账', '红股入帐', '港股通组合费收取', '货币基金收益结转建信', '货币基金收益结转', '配售中签', '证券转银行',
    '银行转取存管交行', '银行转取', '融资利息扣款', '银行转取存管工行', '银行转取交行存管', '质押回购拆出', '货币基金收益结转建信?',
    '托管转入', '港股通证券组合费', '转托转入', '港股通组合费', '股份转入','组合费','股息红利税补缴','股息红利税补','银证转出',
    '市值认购资金扣收','市值申购中签扣款','股息红利扣税农业银行','新股申购确认','新股申购确认缴款','红股','货币基金收益结转财富','新股登记',
    '新股入账','股息红利扣税天邦股份','深圳市场股息红利个人所得税扣款','股息红利扣税浙江美大', '股息红利扣税', '股息红利个人所得税扣款',
    '股息红利差异扣税','证券买入','基金申购清算','ETF现金差额','转托管费', '担保品划入', '担保品提交划入', '证券托管', '个人所得税扣款',
    '证券买入', '配售缴款', '红利差异税扣税', '股息个税征收', '偿还融资负债本金', '偿还融资利息', '担保品划入', '银行转取招行三方存管',
    '股息红利扣税建设银行', '担保物转入', '担保品返回划入', '担保券划入', '转托管转入', '上市流通新增证券','多还退券',
    '权证上账',
)
# 普通账户卖出交易类型 （持仓减少，资金增加）
NORMAL_DIRECTION_SELL_TRADE_CLASS = (
    '银行转证券', 'ETF 申购退款', '现金替代返还', 'ETF现金替代退款', '拆出质押购回', '银行转存', '银行转存存管交行', '余额入账',
    '银行转存存管工行', '利息归本', '现金替代退款','批量利息归本存管交行','批量利息归本存管工行','银证转入','股息入帐浙江美大','股息入账',
    '股息入帐','红股派息','托管转出','市值申购中签','市值申购中签扣款回冲','港股派息','证券清理','银行转存招行存管','港股通红利发放紫金矿?',
    '利息结转', '港股通红利发放', '债券兑息', '资金调加', '批量利息归本','ETF现金退补','港股红利发放资金交收','转托管出','托管转出',
    '利息归本', '普通委托', '担保品划出', '红利入账', '担保品返回划出', '卖券还款', '非交易过户股份', '证券卖出', '担保物转出', '股份转出',
    '担保品返回划', '转托管转出', '转托转出  ', '转托转出', '担保券划出', '直接还券','股息入帐建设银行',
)
# 普通账户无交易方向交易类型 （持仓无变化, 钱无变化）
NORMAL_DIRECTION_NONE_TRADE_CLASS = (
    '股息个税征收', '配售配号', '配售缴款', '新股申购失败', '撤销指定','新股申购失败','申购配号', '红利入账','港股资金可用处理',
    '配股权证到帐','资金红冲','资金蓝补', '|', '删除银行账号', '银行帐户开户', '融资融券证券冻结', '融资借入',
)

# 两融账户允许证券代码为空的交易类型
MARGIN_BLANK_SECURITY_TRADE_CLASS_ALLOWANCE = (
    '利息归本存管交行', '银行转取存管交行', '偿还融资利息', '融资利息扣款', '证券转银行', '银行转存', '银行转取', '利息归本',
    '偿还融资负债本金', '资产修正存', '资产修正取', '融资借款', '融资直接还款', '融资直接还息', '资金长冻', '资金冻结取消',
    '融资借入', '融资定期还息', '融资合约了结还息', '融资还款', '融资卖出还息(-)', '融资卖出还款(-)',
    '融资卖出还款', '融资卖出还息', '转账取预冻结', '转账冻结取消', '融资白天直接还息(-)', '融资白天直接还款(-)',
    '透支冲正', '直接偿还其他负债', '直接偿还其他负债利息', '融资直接还息(-)', '融资直接还款(-)',
    '费用负债归还', '费用利息支付', '融资负债卖券还款', '融资利息支付', '融券定期还息(-)', '融资负债直接还款',
    '红利补偿金额扣收', '红股入账', '利息税','专项融券费用扣收','股息红利税补缴', '卖券偿还其他负债', '卖券偿还其他负债利息',
    '待扣收转其他负债转入','融资利息结转扣收',


)

# 两融账户买入交易类型 （持仓增加，资金减少）
MARGIN_DIRECTION_BUY_TRADE_CLASS = (
    '利息归本存管交行', '银行转取存管交行', '融资利息扣款', '偿还融资利息', '证券转银行','银行转取','港股通组合费', '偿还融资负债本金',
    '股息红利差异扣税','资产修正取','红股入帐'
)
# 两融账户卖出交易类型 （持仓减少，资金增加）
MARGIN_DIRECTION_SELL_TRADE_CLASS = (
    '担保品卖出', '银行转存', '担保物转出', '利息归本','资产修正存','股息入帐'
)


# 两融账户无交易方向交易类型 （持仓无变化, 钱无变化）
MARGIN_DIRECTION_NONE_TRADE_CLASS = (
)

# # 期权流水缺失资金发生数需要即时计算的例外
# OPTION_FLOW_CASH_MOVE_CALCULATION = (
#     '招商期权', '兴业期权','中信期权'
# )
#
# # 期权买入交易类型
# OPTION_DIRECTION_BUY_TRADE_CLASS = ('买', '认购', '出金','银行转取','转存管转出', )
# # 期权卖出交易类型
# OPTION_DIRECTION_SELL_TRADE_CLASS = ('卖', '入金', '认沽','转存管转入','利息归本', )
# # 期权无交易方向交易类型
# OPTION_DIRECTION_NONE_TRADE_CLASS = tuple()
#
# # 期权权利仓类型表达
# OPTION_RIGHT_WAREHOUSE_CLASS = ('权利方', )
# # 期权义务仓类型表达
# OPTION_VOLUNTARY_WAREHOUSE_CLASS = ('义务方', )
# # 期权无仓位类型表达
# OPTION_None_WAREHOUSE_CLASS = ('银行转取', '转存管转出', '转存管转入','利息归本','出金','入金')
#
# # 期权开平方向
# OPTION_OFFSET_OPEN_RANGE = ('开', '开仓', '买入开仓', '卖出开仓', '买开', '卖开')
# OPTION_OFFSET_CLOSE_RANGE = ('平', '平仓', '买入平仓', '卖出平仓', '买平', '卖平')
# OPTION_NONE_RANGE = ('银行转取', '转存管转出', '转存管转入','利息归本','出金','入金',)
#
# # 期货无交易方向类型
# FUTURE_DIRECTION_NONE_TRADE_CLASS = ()
#
# 期货买入交易类型
FUTURE_DIRECTION_BUY_TRADE_CLASS = ()

# 期货卖出交易类型
FUTURE_DIRECTION_SELL_TRADE_CLASS = ()

# 期货开平方向
FUTURE_OFFSET_OPEN_RANGE = ()
FUTURE_OFFSET_CLOSE_RANGE = ()

PRODUCT_NAME_RANGE = (      # 产品合法性检查，谨慎修改！！！
    '久铭1号', '久铭2号', '久铭3号', '久铭5号', '久铭6号', '久铭7号', '久铭8号', '久铭9号', '久铭10号',
    '久铭300指数', '全球1号', '久铭50指数', '收益1号', '收益2号', '双盈1号', '稳利2号', '久铭500指数', '久盈2号',
    '稳健1号', '稳健2号', '稳健3号', '稳健5号', '稳健6号', '稳健7号', '稳健8号', '稳健9号',
    '稳健10号', '稳健11号', '稳健12号', '稳健15号', '稳健16号', '稳健17号', '稳健18号', '稳健19号',
    '稳健21号', '稳健22号', '稳健23号', '稳健31号', '稳健32号', '稳健33号',
    '创新稳健1号', '创新稳健2号', '创新稳健3号', '创新稳健5号', '创新稳健6号',
    '创新稳益1号', '创新稳禄1号', '创新稳禄2号', '创新稳禄3号',
    '稳健1号信用','久铭创新稳健5号',
    '创新稳禄12号', '创新稳禄14号',
    '专享1号', '信利1号', '久铭信利', '专享5号', '专享6号', '专享7号', '专享8号', '专享10号','专享29号',
    '专享16号', '专享17号', '专享9号', '专享11号',
    '价值1号', '全球丰收1号', '专享15号', '专享2号',
    '静康1号', '静康全球1号', '静康稳健1号', '静康创新稳健1号', '静康稳健3号', '静久康铭稳健5号',
    '稳禄1号','专享21号','专享22号','专享23号','专享18号','专享19号','专享20号','专享25号','专享26号','专享27号','专享28号'
)


